
Теперь когда мы получили начальную и конечную точку, надо сравнить lineEnd с каждым элементом high = {} или
 low  = {} соответственно в диапазоне от соответствующего lineStart
 до соответствующего lineEnd.
Если в этом диапазоне чисел есть числа с разницей больше 

Теперь надо сравнить 
если trendDir  = 1, числа в диавазоне от lineStart до lineEnd в таблице low, чтобы найти минимальное. Минимальное число становится новым lineStart
если trendDir  = -1, числа в диавазоне от lineStart до lineEnd в таблице high, чтобы найти максимальное. Максимальное число становится новым lineStart

От нового lineStart надо найти соответствующее значение high или low для которого разница >= deviation это будет новый lineEnd

Теперь.
Если trendDir = 1 и high >= lineEnd, то lineEnd = high
Если же low <= lineEnd-lineEnd*deviation, то lineStart = lineEnd а lineEnd = low  -- lineEnd-lineEnd*deviation это в смысле лоу меньше хая на deviation (а то вдруг я обсчитался)
Если trendDir = -1 и low <= lineEnd, то lineEnd = low 
Если же high >= lineEnd+lineEnd*deviation, то lineStart = lineEnd а lineEnd = high  -- lineEnd+lineEnd*deviation это зеркально верхнему

Для кода робота на lua high и low перезаписываются. Старые нахрен не нужны. Нужна только последняя линия.
Для визуализации на питоне все линии надо сохранить, чтобы видеть что все правильно.

Вне границ регрессионного тренда:

Если trendDir == 0
	1 При пробое нижней границы Vil+Plato Extension вверх вход в лонг.
	2 При пробое верхней границы Vil+Plato Extension вниз вход в шорт.

Если trendDir == 1
Вход в шорт ограничен -- вход только по условию
	1 При пробое верхней границы регрессионного канала вниз вход в шорт
	2 При пробое нижней границы регрессионного канала вниз вход в шорт
	
	3 При пробое нижней границы регрессионного канала вверх вход в лонг
	4 Вход в лонг по любому сигналу внутри канала
	
	 
	


1800 2475 -25   -1175 2400 -900 875  | 5450
-100 225  -1625 525   -425 -675 -450 | -2525 итого 2925